# Getting Started with pandas

In [1]:
import pandas as pd

In [2]:
from pandas import Series, DataFrame

In [4]:
import numpy as np
np.random.seed(12345)

In [ ]:
import matplotlib.pyplot as plt

In [6]:
plt.rc('figure', figsize=(10, 6))
PREVIOUS_MAX_ROWS = pd.options.display.max_rows
pd.options.display.max_rows = 20
np.set_printoptions(precision=4, suppress=True)

## Series
- one-dimensional array-like object

In [7]:
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [14]:
obj.values

array([ 4,  7, -5,  3])

In [15]:
obj.index  # like range(4)

RangeIndex(start=0, stop=4, step=1)

- a series can have a custom index, which can be a `string`

In [20]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [21]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [24]:
obj2['d'] = 6
obj2[['c', 'a', 'd']]

c    3
a   -5
d    6
dtype: int64

- or another type
    - e.g., a date

In [129]:
from datetime import datetime

In [130]:
date_series = pd.Series([4, 7, -5, 3], index=pd.date_range(datetime.today(), periods=4))
date_series

2022-07-20 16:29:49.486016    4
2022-07-21 16:29:49.486016    7
2022-07-22 16:29:49.486016   -5
2022-07-23 16:29:49.486016    3
Freq: D, dtype: int64

- we can use boolean operations to filter series

In [135]:
obj2[obj2 > 0]

0    1.5
dtype: float64

- we can perform numerical operations on the elements without using loops

In [134]:
np.exp(obj2)

0    4.481689
1    0.082085
2    1.000000
dtype: float64

In [29]:
'b' in obj2, 'e' in obj2

(True, False)

In [30]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [31]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

- no value for 'California' was found, it appears as `NaN` (not a number)
    - in pandas to mark missing or NA values
    
- Since 'Utah' was not included in states, it is excluded from the resulting object

In [33]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [34]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [35]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

#### series alignment
- automatically aligns by index label in arithmetic operations
- like a **join** in DB

In [39]:
print(obj3)
print()
print(obj4)

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [36]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

#### series and index names
Both the Series object itself and its index have a name attribute

In [42]:
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [44]:
print(obj)
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

## DataFrame
Remember that a DataFrame ha 2 indexes:
- row index
- column index
    - same type data within a column

#### initialize form dict
A DataFrame can be initialized from a dict:
- dict keys are the columns
- dict values are the values of the column

In [48]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003, 2004],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2, 3.3]}
frame = pd.DataFrame(data)

In [49]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2
6  Nevada  2004  3.3

#### head
to show the first 5 (default number) elements only

In [52]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

If we specify a sequence of columns, the DataFrame’s columns will be arranged in that order

In [53]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2
6  2004  Nevada  3.3

Passing a column that is not in the dict, it will appear as missing values

In [57]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                      index=['one', 'two', 'three', 'four',
                             'five', 'six', 'seven'])
print(frame2.columns)
frame2.head()

Index(['year', 'state', 'pop', 'debt'], dtype='object')

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

#### accessing to the columns
- with "attribute notation"
- with "dot notation"

In [61]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
seven    Nevada
Name: state, dtype: object

In [62]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
seven    2004
Name: year, dtype: int64

#### accessing row
Rows can also be retrieved by position or name
- To access to a single row, we use:
    - `.loc` and the index name assigned to the row
    - `.iloc` and the index number of the row

In [66]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [67]:
frame2.iloc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

#### filling missing values
To fill an entire column

In [69]:
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5
seven  2004  Nevada  3.3  16.5

In [71]:
frame2['debt'] = np.arange(7.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0
seven  2004  Nevada  3.3   6.0

#### DataFrame and Seres
If we assign a Series
- its labels will be realigned exactly to the DataFrame’s index
- missing values will be inserted in any holes

In [72]:
val = pd.Series([-1.2, -1.5, -1.7], 
                index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN
seven  2004  Nevada  3.3   NaN

We can see a DataFrame as a collection of Series

#### Adding a column
To add a column
- just assign the value to the column as if it is already there

In [81]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False
seven  2004  Nevada  3.3   NaN    False

#### delete a column
- `del` command

In [82]:
del frame2['eastern']
frame2.head()

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

### dict of dicts
Another common form of data is a nested dict of dicts

In [89]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [90]:
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

it can be easily transposed

In [91]:
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

- keys of dict are not sorted
- so we can assign our index

In [109]:
pd.DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

### Index Objects
- pandas’s Index objects are responsible for holding the axis labels and other metadata
    like the axis name or names
- Any array or other sequence of labels used to construct a Series or DataFrame is internally converted to an Index

In [112]:
obj = pd.Series(range(3),
                index=['a', 'b', 'c'])
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [113]:
index[1:]

Index(['b', 'c'], dtype='object')

- Index objects are immutable and thus can’t be modified by the user
    - e.g., `index[1] = 'd'  # TypeError`

In [116]:
# index[1] = 'd'

- Immutability makes it safer to share Index objects among data structures

In [117]:
labels = pd.Index(np.arange(3))
labels

Int64Index([0, 1, 2], dtype='int64')

In [118]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [119]:
obj2.index is labels

True

- (column and row) indexes are array-like
- but behaves also like sets
    - versatility, e.g., to check whether a dataframe contains a column

In [121]:
frame3
frame3.columns
'Ohio' in frame3.columns, 2003 in frame3.index

(True, False)

## Essential Functionality
We now focus on the most important features
- many more features can be found in the doc

### Reindexing
- reindex creates a new object with the data conformed to a new index
- rearranges the data according to the new index
- introduces missing values if any index values were not already present

In [138]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], 
                index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [140]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e','f','g','h'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
f    NaN
g    NaN
h    NaN
dtype: float64

In [141]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

#### ffill
For ordered data like time series, it may be desirable to do some interpolation or filling of values when reindexing
- The method option allows us to do this, using a method such as ffill

In [143]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [147]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=['a', 'c', 'd'],
                     columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

#### iloc for dicing
- we can pass two lists to `iloc` for *dicing* the DataFrame

In [154]:
frame.loc[['a', 'c'], ['Ohio', 'Texas']]

   Ohio  Texas
a     0      1
c     3      4

### Dropping Entries from an Axis
- dropping one or more entries from an axis is easy if you already have an index array or list without those entries

#### drop in series

In [164]:
obj = pd.Series(np.arange(5.),
                index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [165]:
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [168]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

#### drop in DataFrame
- default axis = 0
     - defalt is dropping the row

In [186]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [187]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [188]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [189]:
data.drop(['two', 'four'], axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

#### inplace
the object is modified, we don't need to save a copy of the chage

In [190]:
obj.drop('c', inplace=True)
obj

a    0.0
b    1.0
d    3.0
dtype: float64

### Indexing, Selection, and Filtering
- Series indexing (obj[...]) works analogously to NumPy array indexing
- except we can use the Series’s index values instead of only integers

In [195]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
print(obj)
print()
print(obj['b'])
print()
print(obj[1])

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

1.0

1.0

In [197]:
print(obj[1:4])
print()
print(obj[['b', 'a', 'd']])

b    1.0
c    2.0
d    3.0
dtype: float64

b    1.0
a    0.0
d    3.0
dtype: float64

#### slicing with index number
- `[:2]`expludes the element in 2
- it's like `<2`

In [208]:
print(obj[:2])
print()
print(obj[obj < 2])

a    0.0
b    5.0
dtype: float64

a    0.0
dtype: float64

#### slicing with labels
- Slicing with labels behaves differently than normal Python slicing in that the end-point is inclusive
- the ieda is that labels are not ordered, so we read "until that label"
    - like it or not :)

In [209]:
obj[:'b']

a    0.0
b    5.0
dtype: float64

In [210]:
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

#### Selection with loc and iloc
- `loc`
    - first paramenter: rows
    - second parameter: columns

In [213]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [214]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int64

In [216]:
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    4    5
Utah        11    8    9

In [217]:
data.loc[:'Utah', 'two']

Ohio        1
Colorado    5
Utah        9
Name: two, dtype: int64

In [219]:
data.iloc[:, :3]

          one  two  three
Ohio        0    1      2
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

In [225]:
# data.iloc[:, :3] is a dataframe itself
# so we can filter it with a boolean mask (a boolean array)
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

### Integer Indexes

In [227]:
ser = pd.Series(np.arange(3.))

In [228]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

#### `loc` vs `iloc`
- `loc` is for **label**
- `iloc` is for **integer**

In [235]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

In [236]:
ser.iloc[:1]

0    0.0
dtype: float64

### Arithmetic and Data Alignment
- An important pandas feature for some applications is the behavior of arithmetic between objects with different indexes
- When we are adding together objects, if any index pairs are not the same, the respective index in the result will be the union of the index pairs
    - This is similar to an automatic outer join on the index labels

In [238]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], 
               index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
               index=['a', 'c', 'e', 'f', 'g'])
print(s1)
print()
print(s2)

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [239]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [241]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                   index=['Ohio', 'Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                   index=['Utah', 'Ohio', 'Texas', 'Oregon'])
print(df1)
print()
print(df2)

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [242]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

#### Arithmetic methods with fill values

In [249]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                   columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                   columns=list('abcde'))
df2.loc[1, 'b'] = np.nan

In [250]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [251]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [252]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

#### filling "dangling" columns and rows

In [255]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [257]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

#### Operations between DataFrame and Series

In [261]:
arr = np.arange(12.).reshape((3, 4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [262]:
arr[0]

array([0., 1., 2., 3.])

In [263]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [273]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
series = frame.iloc[0]

In [274]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [275]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [276]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

### Function Application and Mapping
NumPy functions works also with DataFrame!

In [278]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame
np.abs(frame)

               b         d         e
Utah    0.204708  0.478943  0.519439
Ohio    0.555730  1.965781  1.393406
Texas   0.092908  0.281746  0.769023
Oregon  1.246435  1.007189  1.296221

### Lambra Functions
- anonymous functions 
    - they don't have a name
- functions that we define on the fly
- usually because we don't reuse it
    - or because are soo simple and intuitive to read

In [302]:
frame.b.max() - frame.b.min()

1.8021650407337724

In [303]:
# min and max compute the minimum and maximum of a series, respectively
frame.apply(lambda x: x.max() - x.min())

b    1.802165
d    1.684034
e    2.689627
dtype: float64

In [312]:
frame.loc['Utah'].max() - frame.loc['Utah'].min()

0.9983820531142864

In [313]:
frame.apply(lambda x: x.max() - x.min(), axis='columns')

Utah      0.998382
Ohio      2.521511
Texas     0.676115
Oregon    2.542656
dtype: float64

#### watch out to che parameter `axis`
If we pass `axis='columns'` to `apply`, the function is called once per row instead

In [318]:
def f(x):
    return pd.Series([x.min(), x.max()], 
                     index=['min', 'max'])
frame.apply(f)

            b         d         e
min -0.555730  0.281746 -1.296221
max  1.246435  1.965781  1.393406

### Element-wise applymap
- apply a function to each element

In [326]:
## truncate the number to 2 digit
frame.applymap(lambda x: '%.2f' % x)

            b     d      e
Utah    -0.20  0.48  -0.52
Ohio    -0.56  1.97   1.39
Texas    0.09  0.28   0.77
Oregon   1.25  1.01  -1.30

- for series it's `map`

In [327]:
frame['e'].map(lambda x: '%.2f' % x)

Utah      -0.52
Ohio       1.39
Texas      0.77
Oregon    -1.30
Name: e, dtype: object

### Sorting
- Sorting a dataset by some criterion is another important built-in operation
- To sort lexicographically by row or column index we use the sort_index method, which returns a new, sorted object

In [328]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [330]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=['three', 'one'],
                     columns=['d', 'a', 'b', 'c'])
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [331]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [332]:
frame.sort_index(axis=0).sort_index(axis=1)

       a  b  c  d
one    5  6  7  4
three  1  2  3  0

In [333]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

#### sortvales
- we can sort a series by its values

In [337]:
obj = pd.Series([4, 7, -3, 2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [338]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

- DataFrames needs the index label, for sorting by values
    - if we pass more indexes, we have a secondary sort (i.e., we sort ties)

In [350]:
frame = pd.DataFrame({'a': [0, 1, 0, 1],'b': [4, 7, -3, 2]})
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [351]:
frame.sort_values(by='a')

   a  b
0  0  4
2  0 -3
1  1  7
3  1  2

In [352]:
# secondary sort
frame.sort_values(by=['a', 'b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

### Axis Indexes with Duplicate Labels
- Pandas allows for duplicates labels in the indexe
- it can lead to different behaviour in your code
    - can yield "bugs", so watch out!

In [390]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [391]:
obj.index.is_unique

False

In [394]:
print(obj['a'])
print()
print(obj['c'])

a    0
a    1
dtype: int64

4

In [395]:
df = pd.DataFrame(np.random.randn(4, 3),
                  index=['a', 'a', 'b', 'b'])
df
df.loc['b']

          0         1         2
b -1.541996 -0.970736 -1.307030
b  0.286350  0.377984 -0.753887

## Summarizing and Computing Descriptive Statistics
- Pandas objects are equipped with a set of common mathematical and statistical methods
- Most of these fall into the category of reductions or summary statistics, methods that extract a single value (like the sum or mean) from a Series or a Series of values from the rows or columns of a DataFrame
- They have built-in handling for missing data

In [396]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=['a', 'b', 'c', 'd'],
                  columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [399]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [400]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [401]:
df.mean(axis='columns', skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [421]:
df.idxmin().keys()[0]

'one'

In [422]:
# return indirect statistics like the index value where the minimum or maximum values are attained
print(r'the minimum values for the column {} is in the row: {}'.format(df.idxmin().keys()[0], df.idxmin()[0]))
print(r'the minimum values for the column {} is in the row: {}'.format(df.idxmin().keys()[1], df.idxmin()[1]))
print()
print(r'the maximum values for the column {} is in the row: {}'.format(df.idxmax().keys()[0], df.idxmax()[0]))
print(r'the maximum values for the column {} is in the row: {}'.format(df.idxmax().keys()[1], df.idxmax()[1]))

the minimum values for the column one is in the row: d
the minimum values for the column two is in the row: b

the maximum values for the column one is in the row: b
the maximum values for the column two is in the row: d

In [423]:
# sum with accumulation
# good for cumulative histograms, e.g., sells up to a date
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

### describe
- `.describe` produces multiple summary statistics in one shot
- it changes the type of stats on the basis of the type of the values

In [432]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [436]:
obj = pd.Series(['a', 'a', 'b', 'c'] * 2)
obj

0    a
1    a
2    b
3    c
4    a
5    a
6    b
7    c
dtype: object

In [437]:
obj.describe()

count     8
unique    3
top       a
freq      4
dtype: object

### Unique Values, Value Counts, and Membership

In [445]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [446]:
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [447]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [448]:
pd.value_counts(obj.values, sort=False)

c    3
a    3
d    1
b    2
dtype: int64

In [449]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

#### masking

In [454]:
mask = obj.isin(['b', 'c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [455]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object